{
  "en": {
    "exp": {
      "header": "Experience",
      "exps": [
        {
          "topic": "React development",
          "flag": "react",
          "timeframe": "September 2018 - to date",
          "text": "In September 2018 I started working as the project leader on the Digiwie-project at AteljeeVZW. The project involved the migration of all the unstructured data on Google Drive to a centralized system. The system needed a database and a client in the form of a website. Clients had to be able to enlist or delist in/from our courses while the teachers had to be able to create, update and delete courses, course material and handle student scores & attendance lists. The system thus served both as a portal for our clients as it is a means to manage all our resources & client data: a tailor-made CMS if you will... As technology stack I have chosen for the MERN stack, both for learning purposes and mastering MongoDB, Express, React & NodeJS while using the Agile approach. The system is expected to run on a Docker container, hosted on a Ubuntu server. It will be released somewhere in the near future."
        },
        {
          "topic": "Mobile development",
          "flag": "android",
          "timeframe": "November 2017 - May 2018",
          "text": "In 2017 I created a native mobile application for the Android platform showing various weather products like high resolution Radar imagery and Live lightning detection throughthe use of publically available websockets. The imagery is rendered using the Google Maps API while the backend is running an Ubuntu system. It reads Raw Radar data from various OpenDATA sources like the DWD & KNMI institutes. Using Python this raw data is processed to create sensible images. Afterwards the processed images are georeferenced using the Gdal library after being filtered by customized algorithms. There I rule out false-echo's, beam attenuation & missing data by various interpolation techniques. At the end of the process chain the data is made available through the app."
        },
        {
          "topic": "Digipoint admin",
          "flag": "digipoint",
          "timeframe": "January 2015 - to date",
          "text": "Since 2015 I am working as a Digipoint admin at AteljeeVZW where I am a teacher and the primary contact for people having computer problems, and clients in need of assistance. The title also allows me to teach various ICT-related subjects to our students of all age & background and collegues. The material I teach cover topics as devops, programming, database administration and development in general. Besides that I'm also responsible writing reports for meetings and communicating the information to the rest of the team. In the latter part of 2018 I was appointed as the project leader for the Digiwie project to create a centralized system for all our data."
        },
        {
          "topic": "Backend development",
          "flag": "backend",
          "timeframe": "February 2015 - September 2016",
          "text": "2015 marked the beginning of a 1.5 year period where I helped a weather website get on its feet. My tasks involved getting the server up & running while providing the people involved with the meteorological products to fill the website with data. Through complicated meteorological calculus I created modern meteorological charts, radar imagery, lightning-detection algorithms and radar-based detection algorithms using cluster recognition patterns. Afterwards the data needed georeferencing through Python to display them on both the Google Maps API and offline maps using Matplotlib. The system ran on an Ubuntu machine. Since my departure the website hasn't been maintained to its fullest by the people involved. My work however was not in vain since the gained knowhow & technologies used are now being implemented in a new project. A collaboration with like-minded people allowed us to elaborated on the work already done. Expect a release soon!"
        },
        {
          "topic": "Networking & support",
          "flag": "support",
          "timeframe": "2003 - 2009",
          "text": "During the 2003 - 2009 period I have had temporary jobs as network-administrator and support-related functions. I provided network and soft- and hardware support in the medical sector to mainly Doctors and hospitals in the Radiology department. In light of the migration to a more digital approach of taking MRI's and other echoes I was assigned the task of supporting the digitisation, storage and office-network of the new systems. I also worked at an institute which served as both a school and shelter for troubled children where I also provided support for all employees. As a computer technician/support engineer I worked for a small office which provided support for several local  businesses."
        }
      ]
    },
    "edu": {
      "header": "Education",
      "edus": [
        {
          "topic": "Frontend developer",
          "flag": "frontend",
          "timeframe": "September 2018 - to date",
          "text": "In september 2018 I started a 2 year course in Frontend web development. The non-frontend material covered, involved programming techniques and analysis. Also covered was using SQL to manage databases, create and optimize database models using database normalisations and ERD diagrams. The frontend material covered the unavoidable triangle of HTML5, CSS & Javascript. The semantics and use of the correct HTML5 tags were widely covered as were the newest CSS techniques like flexbox & the CSS grid. These were followed by the now widely used SCSS using BEM/SMACSS conventions. While vanilla-Javascript was extensively covered, it was followed by the jQuery library. The first year has been successfully completed. The second year will cover frontend frameworks like React and Angular."
        },
        {
          "topic": "MERN front to back",
          "flag": "reactedu",
          "timeframe": "July 2018 - September 2018",
          "text": "Using a course on Udemy I learned how to set up a full stack project using the MERN stack. The course started from the first line of code and ended with deployment to Heroku. Throughout the project I was introduced to Redux as the state management system and how it can be implemented in React. During the project the difficulty gradually increased as we began exploring more in-depth React workings and HOC's. While React is used on the frontend the student also had to write a complete working backend. It covered security measures & login-functionality using a JWT and we had to build a fully functional RESTful API connecting to a MongoDB database through Express & NodeJS as javascript backend frameworks."
        },
        {
          "topic": "Android Nanodegree",
          "flag": "google",
          "timeframe": "September 2017 - June 2018",
          "text": "In september 2017 I enlisted in the Google Developer Challenge, a challenge organised by Google across the whole European continent. More than 200000 participants enlisted while Google granted only 10% of the participants to join the challenge based on motivation and programming skills. Being among the 20000 passed, the challenge was to create 3 Android projects while being coached by Google employees in Java, UX, GUI design & Android development in general. Only 10% would be able to pass based on wits, aiding fellow students, quality of the finished projects & adhering to the strict coding standards by Google. Again being one of the 10% I was rewarded with a full scholarship of 1 year being taught by developers of Google. After a successful review of my graduation-project I was gratified to receive the certificate of \"Android developer Nanodegree\" by Google through the Udacity learning platform."
        },
        {
          "topic": "Meteo, DevOps & Scripting",
          "flag": "meteo",
          "timeframe": "2009 - to date",
          "text": "Fueled by a gradual interest in Meteorology I learned DevOps and programming languages to generate and plot raw meteorological data. This data came from various international sources which made them available in data formats I have never even heard of. From the onset it became clear that I first needed to go through Linux, Bash, Python and Cronjobs. Only then I could start to create sensible output from those elusive HDF5, NetCDF and BUFR files. So I learned the GrADS scripting language, plotting and scientific abilities of libraries such as MPL and SciPy in Python & GIS tools such as Gdal and ArcGIS. My progress eventually shook the Benelux meteo community which did not go unnoticed. The Flemish association for weather knowledge took notice of my work which and have since then invited me on a regular basis to give lectures in Meteorology,  plotting techniques and analysis of extreme weather conditions using the products I am since then able to generate."
        },
        {
          "topic": "Bachelor ICT",
          "flag": "hogent",
          "timeframe": "2001 - 2003",
          "text": "In 2003 I enlisted in the evening education program of Applied ICT in Hogent. In this 3 year linear program we were educated in data structure, programming & analysis techniques, database administration and the .NET framework. After a succesful completion of my first year, I excelled in databases and had above average scores in programming. I was eager to complete my full program but In the latter half of the second year I had to stop because of work & personal reasons. The knowledge and experience, I gained during the nearly two years of studies however, formed the foundation of my abilities now. I might still go through the complete program again which is now a modular system if time, personal life, work and financial status agree."
        },
        {
          "topic": "Self taught",
          "flag": "self",
          "timeframe": "2000 - to date",
          "text": "Through the latter half of my 38 years I've been an autodidact in using all sorts of ICT related material, covering networking, operating systems, troubleshooting techniques, application development, web development, mobile development, and much more. I've been a curious person all my life which makes me somebody that gets triggered very easily to learn. I also like to discover new things and approaches other people use to tackle a problem. Collaboration is key!"
        }
      ]
    },
    "skill": {
      "header": "Familiar with"
    },
    "lang": {
      "header": "Languages",
      "languages": [
        {
          "field": "Dutch",
          "flag": "lang",
          "scores": [
            {
              "topic": "Spoken",
              "score": 95
            },
            {
              "topic": "Written",
              "score": 95
            }
          ]
        },
        {
          "field": "English",
          "flag": "lang",
          "scores": [
            {
              "topic": "Spoken",
              "score": 90
            },
            {
              "topic": "Written",
              "score": 85
            }
          ]
        },
        {
          "field": "French",
          "flag": "lang",
          "scores": [
            {
              "topic": "Spoken",
              "score": 60
            },
            {
              "topic": "Written",
              "score": 65
            }
          ]
        }
      ]
    },
    "test": {
      "header": "Testimonials",
      "testimonials": [
        {
          "name": "Patrick Moesick",
          "where": "AteljeeVZW",
          "testimonial": "\"Dzengiz is somebody you can always count on to get the job done. There is nothing I can not entrust him with. By himself he developed our full-stack web application to manage our clients, course material and online workshops while still having time to teach fellow collegues, help clients with their ICT related issues & do administrative tasks. His drive & engagement is second to none. You will not be disappointed to have him on your team!\""
        },
        {
          "name": "Michaël Verhaeghe",
          "where": "Chase2be",
          "testimonial": "\"Being nothing short of a mentor, Dzengiz brought me up to speed on how to use Python and various other scripting languages to generate meteorological products using a blend of coding skills, mathematics, dev-ops and creativity. I would not stand where I am if it wasn't for the guidance Dzengiz provided in my journey in the world of ICT and meteorology.\""
        }
      ]
    },
    "personal": {
      "maritalText": "Living together"
    }
  },
  "nl": {
    "exp": {
      "header": "Ervaring",
      "exps": [
        {
          "topic": "React development",
          "flag": "react",
          "timeframe": "September 2018 - heden",
          "text": "In september 2018 ben ik in AteljeeVZW aangesteld als projectleider voor het Digiwie-project, waarin alle ongestructureerde data op Google Drive diende gemigreerd te worden naar een gecentraliseerd systeem. Het systeem diende gekoppeld te worden aan een databank met een client- applicatie in de vorm van een website. Klanten moesten zich kunnen in- en uitschrijven in/uit onze cursussen terwijl de lesgevers een beheermodule nodig hadden om de cursussen en het cursusmateriaal te beheren, studentenscores bij te houden en aanwezigheden op te nemen. Als technologie heb ik gekozen voor de MERN stack, dit als leerproces om MongoDB, Express, React en NodeJS onder de knie te krijgen. Ook wenste ik Agile te werken met oog op toekomstige uitbreiding. Het systeem wordt in de nabije toekomst verwacht gedeployed te worden in een Docker container."
        },
        {
          "topic": "Mobile development",
          "flag": "android",
          "timeframe": "November 2017 - Mei 2018",
          "text": "In 2017 heb ik voor privé gebruik een native mobiele Android applicatie ontwikkeld die verschillende meteorologische producten zoals hoge resolutie radarbeelden en live bliksemdetectie toont. Gebruik makend van verschillende publieke websockets en OpenData- bronnen zoals het DWD & KNMI wordt er op de Ubuntu-backend ruwe data ingelezen om die uiteindelijk via de Google Maps API te renderen. Via Python wordt die ruwe data eerst verwerkt tot tastbare images. Na afloop worden deze via postprocessing door huisgemaakte algoritmes verwijderd van valse echo’s, radar-attenuatie en wordt lege data opgevuld door allerlei interpolatietechnieken. Nadat er georeferentie toegepast wordt op de verwerkte beelden via de Gdal- library wordt de data beschikbaar gesteld via de app."
        },
        {
          "topic": "Digipoint admin",
          "flag": "digipoint",
          "timeframe": "Januari 2015 - heden",
          "text": "Sinds 2015 werk ik in AteljeeVZW als digipunt-beheerder waar ik naast het geven van opleidingen het primaire aanspreekpunt ben voor mensen met computerproblemen. De titel laat me ook toe om zowel aan onze studenten van elke afkomst of leeftijd en collega’s les te geven in verschillende ICT-gerelateerde takken zoals devops, programmeren, database-administratie en ICT-technologie in het algemeen. Daarnaast ben ik ook verantwoordelijk voor de verslaggeving tijdens meetings en alles te communiceren naar de rest van het team.  In het najaar van 2018 ben ik aangesteld als projectleider van het Digiwie- project om een gecentraliseerd systeem te ontwikkelen voor al onze data."
        },
        {
          "topic": "Backend development",
          "flag": "backend",
          "timeframe": "Februari 2015 - September 2016",
          "text": "2015 markeerde het begin van een anderhalf jaar waar ik een meteo-website heb helpen opbouwen. Mijn taak hield in om de server op stellingen te zetten en de mensen die de website beheerden van meteorologische producten te voorzien die op de website werden tentoon gesteld. Via Python heb ik gebruik makend van complexe meteorologische calculus moderne meteorologische producten gegenereerd, radar-images geproduceerd en een onweerdetectiesysteem ontwikkeld was gebaseerd was op detectiealgoritmes via cluster-herkenning. Na de flow van post-processing diende georeferentie toegepast te worden om die zowel via Google Maps als offline via Matplotlib plots aan de gebruiker beschikbaar te stellen. Het systeem werkte op een Ubuntu server. De website is na afloop jammer genoeg door de beheerders niet degelijk onderhouden geweest. Mijn werk daarentegen ziet nu nieuw licht in een gelijkaardig project waarop verder gebouwd wordt op de codebase van toen. Een release wordt in de toekomst verwacht."
        },
        {
          "flag": "support",
          "topic": "Networking & support",
          "timeframe": "2003 - 2009",
          "text": "In de periode 2003 – 2009 had ik verschillende netwerk en support-gerelateerde jobs. Ik bood netwerk-, soft- en hardware support in de medische sector aan voornamelijk Dokters en ziekenhuizen in de tak Radiologie. In het licht van de migratie naar een meer digitale benadering van MRI’s en andere foto’s was mijn taak om support te leven in de digitalisatie, data-opslag en het netwerk van de nieuwe systemen. Ik werkte tijdelijk in een instituut voor probleemkinderen die ook als school fungeerde. Daar stond ik ook in voor de levering van support aan alle in-house medewerkers. Ook werkte ik als computertechnieker en support engineer voor een kleine KMO die support bood aan verschillende zaken in de buurt."
        }
      ]
    },
    "edu": {
      "header": "Opleiding",
      "edus": [
        {
          "topic": "Frontend developer",
          "flag": "frontend",
          "timeframe": "September 2018 - heden",
          "text": "In september 2018 startte ik via Syntra aan een tweejarige opleiding tot Frontend web developer. Het non-frontend materiaal had betrekking tot programmeertechnieken, analyse. Ook kwam het gebruik van SQL om databanken te beheren, de creatie en optimalisatie van databankmodellen en ERD-diagrammen aan bod. Het frontend gedeelte benaderde de driehoek HTML5, CSS & Javascript. De semantiek en het correct gebruik van de HTML5 tags werden breed behandeld alsook de nieuwste CSS technieken zoals flexbox en het CSS grid. Dit werd prompt gevolgd door de kracht van SCSS en de BEM/SMACSS conventies. Terwijl “vanilla-javascript” in-depth werd behandeld werd het opgevolgd door jQuery. Het eerste jaar is ondertussen succesvol afgerond. Het tweede jaar behandelt de frontend frameworks React en Angular."
        },
        {
          "topic": "MERN front to back",
          "flag": "reactedu",
          "timeframe": "Juli 2018 - September 2018",
          "text": "Via een cursus op Udemy heb ik geleerd hoe via de MERN stack een ful-stack project te ontwikkelen. De cursus startte vanaf de eerste lijn code tot het uitrollen van het project op Heroku. Doorheen het project werd ik geintroduceerd tot Redux als het state-management systeem en hoe het geimplementeerd wordt in React. Tijdens het project verhoogde de moeilijkheidsgraag gestaag wanneer we de meer in-depth werking van React en HOC’s begonnen te exploreren. Terwijl React op de frontend werd gebruikt, moesten we ook een complete backend implementeren. Deze bevatte beveiliging en login-functionaliteit via een JWT en een volledig functionele RESTful API die via Express en NodeJS connecteert met een MongoDB databank."
        },
        {
          "topic": "Android Nanodegree",
          "flag": "google",
          "timeframe": "September 2017 - Juni 2018",
          "text": "In september 2017 heb ik mij ingeschreven in de “Google developer challenge”, een uitdaging georganiseerd door Google over het hele Europese continent. Van de meer dan 200000 inschrijvingen liet Google amper 10% toe op basis van motivatie en programmeerkennis. Als één van de 20000 was de uitdaging was om 3 Android projecten te ontwikkelen terwijl we coaching genoten van Google medewerkers in Java, UX, GUI ontwerp & Android ontwikkeling. Terug mochten enkel 10% hiervoor slagen, gebaseerd op wilskracht, medewerking in de community, hulp aan medestudenten en de kwaliteit van de 3 projecten. Terug één van de 10% werd ik beloond met een volledige studiebeurs van 1 jaar waarin ik opgeleid werd door de medewerkers van Google als Android developer. Na een succesvolle review van mijn eindproject ontving ik door Google mijn \"Android developer Nanodegree\" via het Udacity leerplatform."
        },
        {
          "topic": "Meteo, DevOps & Scripting",
          "flag": "meteo",
          "timeframe": "2009 - heden",
          "text": "Gedreven door een klimmende interesse in meteorologie leerde ik DevOps en verschillende talen om plots te maken van ruwe meteorologische data. Deze data was afkomstig van een waaier aan internationale bronnen van ruwe data. Ook had deze ruwe data bestandsformaten waar ik tot toen nooit van heb gehoord. Het werd al snel duidelijk dat eerst Linux, Bash, Python en Cronjobs gekend moesten zijn. Om dan tastbare output te kunnen genereren uit de HDF5, NetCDF en BUFR files leerde ik GrADS scripting, de plot- en wetenschappelijke mogelijkhkeden van de MPL en SciPy library en andere Python tools zoals PyPROJ en Gdal voor GIS-toepassingen. Mijn progressie heeft de Benelux meteo-community wakker geschud en dat is de Vlaamse Vereniging voor Weerkunde niet ontgaan. Zij inviteren mij sindsdien op regelmatige basis om lezingen en lectures te geven op vlak van meteorologie, plot- technieken en analyses van extreme weersituaties via de producten die ik sindsdien kan produceren."
        },
        {
          "topic": "Bachelor ICT",
          "flag": "hogent",
          "timeframe": "2001 - 2003",
          "text": "In 2003 schreef ik mij in voor Toegepaste Informatica aan HoGent in het avondschoolprogramma. In dit driejarig programma leerden we datastructuur, programmatie en analysetechnieken, database administratie en het .NET framework. Na het succesvol afronden van mijn eerste jaar was ik een kei was in databanken en behaalde bovengemiddelde scores in programmeren. Ik keek dan ook uit naar het afmaken van het volledig programma. Wegens werk en persoonelijke redenen moest ik daarentegen op het einde van het tweede jaar stoppen. De kennis en ervaring die ik in de bijna 2 jaar van studies heb genoten legden hoe dan ook de basis van mijn huidige kennis. Ik denk er nog steeds aan om het volledige programma nogmaals te volgen, wat sindsdien is veranderd naar een modulair systeem wanneer tijd, privéleven, werk en financiële status dit mogelijk maken."
        },
        {
          "topic": "Autodidact",
          "flag": "self",
          "timeframe": "2000 - heden",
          "text": "Doorheen de laatste helft van mijn 38 jaar ben ik via zelfstudie op de hoogte gebleven van de relevante ICT-technieken, networking, besturingssystemen, troubleshooting, applicatieontwikkeling, web-ontwikkeling en meer. Ik ben al heel mijn leven een curieus persoon en een autodidact, wat mij iemand maakt die gemakkelijk getriggerd wordt om bij te leren. Ook exploreer ik graag nieuwe dingen en benaderingen die anderen gebruiken om een probleem op te lossen. Samenwerking is de sleutel!"
        }
      ]
    },
    "skill": {
      "header": "Vertrouwd met"
    },
    "lang": {
      "header": "Talen",
      "languages": [
        {
          "field": "Nederlands",
          "flag": "lang",
          "scores": [
            {
              "topic": "Spreken",
              "score": 95
            },
            {
              "topic": "Schrijven",
              "score": 95
            }
          ]
        },
        {
          "field": "Engels",
          "flag": "lang",
          "scores": [
            {
              "topic": "Spreken",
              "score": 90
            },
            {
              "topic": "Schrijven",
              "score": 85
            }
          ]
        },
        {
          "field": "Frans",
          "flag": "lang",
          "scores": [
            {
              "topic": "Spreken",
              "score": 60
            },
            {
              "topic": "Schrijven",
              "score": 65
            }
          ]
        }
      ]
    },
    "test": {
      "header": "Referenties",
      "testimonials": [
        {
          "name": "Patrick Moesick",
          "where": "AteljeeVZW",
          "testimonial": "\"Dzengiz is iemand waarop je altijd kan rekenen om een taak te volbrengen. Er is niets wat ik hem niet kan toevertrouwen. Op zichzelf heeft hij onze full-stack web applicatie ontwikkeld om onze klanten, cursusmateriaal en online workshops te beheren terwijl hij nog steeds tijd ziet om de collega’s te helpen, hen bij te leren, klanten te helpen met hun ICT-gerelateerde vragen en administratieve taken te doen. Je zal niet ontgoocheld zijn om hem in uw team te hebben!\""
        },
        {
          "name": "Michaël Verhaeghe",
          "where": "Chase2be",
          "testimonial": "\"Als een mentor bracht Dzengiz mij op kennis om gebruik makend van Python en andere script-talen meteorologische producten te maken in een mix van code-vaardigheden, wiskunde, dev-ops en creativiteit. Ik zou niet staan waar ik nu sta was het niet voor de begeleiding Dzengiz mij heeft gegeven in mijn reis in de wereld van ICT en meteorologie.\""
        }
      ]
    },
    "personal": {
      "maritalText": "Samenwonend"
    }
  },
  "skills": [
    {
      "field": "Frontend development",
      "flag": "web",
      "scores": [
        {
          "topic": "HTML5",
          "score": 80
        },
        {
          "topic": "CSS",
          "score": 75
        },
        {
          "topic": "SCSS",
          "score": 70
        },
        {
          "topic": "Bootstrap",
          "score": 80
        },
        {
          "topic": "Javascript",
          "score": 80
        },
        {
          "topic": "jQuery",
          "score": 70
        }
      ]
    },
    {
      "field": "Frontend frameworks",
      "flag": "web",
      "scores": [
        {
          "topic": "React",
          "score": 75
        },
        {
          "topic": "Redux",
          "score": 75
        }
      ]
    },
    {
      "field": "Mobile development",
      "flag": "mobile",
      "scores": [
        {
          "topic": "Android Studio",
          "score": 75
        },
        {
          "topic": "Cordova",
          "score": 70
        }
      ]
    },
    {
      "field": "Databases",
      "flag": "db",
      "scores": [
        {
          "topic": "SQL",
          "score": 80
        },
        {
          "topic": "MongoDB",
          "score": 75
        }
      ]
    },
    {
      "field": "Backend development",
      "flag": "backend",
      "scores": [
        {
          "topic": "NodeJS",
          "score": 80
        },
        {
          "topic": "Express",
          "score": 75
        },
        {
          "topic": "Python",
          "score": 75
        },
        {
          "topic": "Bash",
          "score": 70
        }
      ]
    },
    {
      "field": "DevOps",
      "flag": "devops",
      "scores": [
        {
          "topic": "Linux",
          "score": 60
        },
        {
          "topic": "Apache",
          "score": 50
        },
        {
          "topic": "Docker",
          "score": 35
        },
        {
          "topic": "Vagrant",
          "score": 35
        },
        {
          "topic": "Samba",
          "score": 60
        }
      ]
    }
  ]
}